weekly_meal_data = {
    "2026-03-09": {
        "조식": {"menu": "고구마스프/콘치즈또띠아롤", "side": "모닝롤, 바게트&딸기잼, 버터, 비엔나구이, 오리엔탈샐러드, 씨리얼2종"},
        "간편식": {"menu": "미운영", "side": ""},
        "중식": {"menu": "제철봄동비빔밥", "side": "봄동겉절이+꽁보리밥, 계란후라이, 데리야끼떡갈비볶음, 미역국, 요구르트"},
        "석식": {"menu": "부대찌개&라면사리", "side": "추가쌀밥, 견과류연근조림, 코울슬로, 깍두기, 펩시콜라라임"},
        "야식": {"menu": "청양마요닭강정", "side": "흰쌀밥, 미소장국, 어묵채볶음, 푸실리케찹무침, 무피클"}
    },
    "2026-03-10": {
        "조식": {"menu": "돈육김치찌개", "side": "흰쌀밥, 메추리알곤약조림, 바싹김구이, 누룽지, 원두커피"},
        "간편식": {"menu": "베이컨감자모닝샌드", "side": "바나나 & 삶은계란"},
        "중식": {"menu": "뚝배기대파육개장", "side": "생선까스튀김 & 와사비마요소스, 흑향미밥, 참나물유자겉절이, 복분자주스"},
        "석식": {"menu": "제주고기국수", "side": "돈삼겹+중화면+고기육수, 추가쌀밥, 다대기, 손만두, 샐러리장아찌"},
        "야식": {"menu": "소고기야채죽", "side": "새송이간장조림, 오징어젓갈무침, 복숭아요플레"}
    },
    "2026-03-11": {
        "조식": {"menu": "황태설렁탕", "side": "흰쌀밥, 너비아니구이&파채, 양념깻잎지, 누룽지, 원두커피"},
        "간편식": {"menu": "에그샌드위치 & 사과주스", "side": ""},
        "중식": {"menu": "불고기호박오일파스타", "side": "쓰리라차닭살구이, 팽이장국, 오리엔탈샐러드, 수제비트무피클, 매실주스"},
        "석식": {"menu": "시래기감자탕", "side": "흰쌀밥, 두부양념조림, 쌈채소무침, 깍두기, 요구르트"},
        "야식": {"menu": "간짜장덮밥", "side": "완두콩밥, 짬뽕국, 인절미탕수육, 짜사이무침, 요구르트"}
    },
    "2026-03-12": {
        "조식": {"menu": "곤드레영양밥 & 양념장", "side": "고등어무조림, 얼큰콩나물국, 오이지무침, 열무김치, 신라면투움바"},
        "간편식": {"menu": "치킨스테이크샐러드", "side": ""},
        "중식": {"menu": "고추장두루치기", "side": "청상추쌈, 쌈장, 혼합잡곡밥, 얼갈이된장국, 후르츠마카로니콘마요, 수정과"},
        "석식": {"menu": "뚝배기불고기나베 & 당면사리", "side": "소떡소떡강정, 흰쌀밥, 마늘종장아찌무침, 깍두기"},
        "야식": {"menu": "크래미에그샌드위치", "side": "초코우유"}
    },
    "2026-03-13": {
        "조식": {"menu": "참치야채죽/크로와상샌드위치", "side": "잡곡식빵, 바게트&딸기잼, 오리엔탈샐러드, 씨리얼2종, 누룽지"},
        "간편식": {"menu": "미운영", "side": ""},
        "중식": {"menu": "소세지카레라이스", "side": "완두콩밥, 유부장국, 실곤약초무침, 구운버섯샐러드, 미숫가루"},
        "석식": {"menu": "춘천식닭갈비", "side": "유채된장국, 흰쌀밥, 청포묵김무침, 와사비쌈무, 열무김치"},
        "야식": {"menu": "우렁강된장덮밥", "side": "미역국, 부추야채전, 동그랑땡구이, 검은콩자반, 포도주스"}
    }
}
